ams/src/Catalogs/ДатаМобайл_ДокументыТСД_ЕГАИС/ДатаМобайл_ДокументыТСД_ЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДатаМобайл_ДокументыТСД_ЕГАИС</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияСбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзмененияКлиента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСбора</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриемкиОператором</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументЧекККМ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланРавноФакт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостановкаНаКарантин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаИзображение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСД</name>
    <type>
      <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ДатаМобайл_ШаблоныДокументов_ЕГАИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СобранныеДанныеПодбор</name>
    <attributes>
      <name>PDF</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>19</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисМарка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисПолныйКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисСправкаА</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕгаисСправкаБ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТовараЕГАИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Короб</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураЕГАИС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Палета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияСсылка</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаИзображение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТСД</name>
      <type>
        <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковочныйЛист</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокТерминалов</name>
    <attributes>
      <name>ТСД</name>
      <type>
        <types>ExchangePlanRef.ДатаМобайл_СписокТСД</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/Catalogs/ДатаМобайл_ДокументыТСД_ЕГАИС/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Попытка
		ОбъектМодифицирован = ОбъектМодифицирован(ЭтотОбъект, Истина, Истина);
		
		Если ОбменДанными.Получатели.АвтоЗаполнение Тогда
			ОбменДанными.Получатели.Очистить();
			
			Если Не ЗначениеЗаполнено(Ссылка) Тогда // новый объект
				Если Не ЗначениеЗаполнено(ТСД) Тогда
					Если СписокТерминалов.Количество() = 0 Тогда
						ОбменДанными.Получатели.Заполнить();
					Иначе
						Для каждого СтрокаТерминал Из СписокТерминалов Цикл
							ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
						КонецЦикла;
					КонецЕсли;
				Иначе	
					ОбменДанными.Получатели.Добавить(ТСД);
				КонецЕсли;	
			Иначе
				Если ОбъектМодифицирован Тогда
					Если Не ЗначениеЗаполнено(ТСД) Или Не ЗначениеЗаполнено(Ссылка.ТСД) Тогда
						Если СписокТерминалов.Количество() = 0 Тогда
							ОбменДанными.Получатели.Заполнить();
						Иначе
							Для каждого СтрокаТерминал Из СписокТерминалов Цикл
								ОбменДанными.Получатели.Добавить(СтрокаТерминал.ТСД);	
							КонецЦикла;
						КонецЕсли;
					Иначе	
						ОбменДанными.Получатели.Добавить(ТСД);
						ОбменДанными.Получатели.Добавить(Ссылка.ТСД);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;

	Если ДатаСоздания = Дата(1,1,1) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;
	
	Если ИсходныйДокумент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсходныйДокумент.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	Если Шаблон.ВыгружатьТолькоПроведенныеДокументы Тогда
		Если ЗначениеЗаполнено(ИсходныйДокумент) Тогда
			Если Не ИсходныйДокумент.Проведен Тогда
				Сообщить("Запрещена выгрузка непроведенных документов");
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;

	Если СокрЛП(Комментарий) = "" Тогда
		Комментарий = СокрЛП(ИсходныйДокумент.Комментарий);
	КонецЕсли;	
	
	Если СокрЛП(Номер) = "" Тогда
		Номер = СокрЛП(ИсходныйДокумент.Номер);
	КонецЕсли;	
	
	Если Клиент = Неопределено Тогда
		Попытка Клиент = ИсходныйДокумент.Партнер; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Отправитель; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Получатель; Исключение КонецПопытки;
		Попытка Клиент = ИсходныйДокумент.Поставщик; Исключение КонецПопытки;
	КонецЕсли;	
	
	Если Склад.Пустая() Тогда
		Попытка Склад = ИсходныйДокумент.ТорговыйОбъект; Исключение КонецПопытки;
		Попытка Склад = ИсходныйДокумент.Помещение.Владелец; Исключение КонецПопытки;
		Попытка Склад = ИсходныйДокумент.Склад; Исключение КонецПопытки;		
		Попытка Склад = ИсходныйДокумент.СкладОтправитель; Исключение КонецПопытки;
	КонецЕсли; 
	
	Если Дата = Дата(1,1,1) Тогда
		Дата = ИсходныйДокумент.Дата;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ТСД.Пустая() Тогда
		Если СписокТерминалов.Количество() = 0 Тогда
			ОбменДанными.Получатели.Заполнить();
		Иначе
			Для каждого стр Из СписокТерминалов Цикл
				ОбменДанными.Получатели.Добавить(стр.ТСД);
			КонецЦикла;
		КонецЕсли;	
	Иначе	
		ОбменДанными.Получатели.Добавить(ТСД);
		
		Для каждого стр Из СписокТерминалов Цикл
			ОбменДанными.Получатели.Добавить(стр.ТСД);
		КонецЦикла;
	КонецЕсли;
	
	ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиТСДГрупповогоДокумента_ОПТ(Ссылка);
	ДатаМобайл_ОбщийМодуль.ОчиститьЗаписиГрупповогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ПриКопировании()

	ДатаСоздания = Дата(1,1,1);
	ДатаНачалаСбора = Дата(1,1,1);
	ДатаЗавершенияСбора = Дата(1,1,1);
	ДатаПриемкиОператором = Дата(1,1,1);
	ДатаЗавершения = Дата(1,1,1);
	Комментарий = "";
	Номер = "";
	Дата = Дата(1,1,1);
	НовыйДокумент = Неопределено;	
	Клиент = Неопределено;
	//Склад = Неопределено;
	ДатаИзмененияКлиента = Дата(1,1,1);
	СсылкаНаИзображение = "";
	ПостановкаНаКарантин = Ложь;
	ДополнительныйДокумент = Неопределено;
	СобранныеДанныеПодбор.Очистить();
	СписокТерминалов.Очистить();
	
КонецПроцедуры   

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектМодифицирован(Объект, ПроверятьТабличныеЧасти = Истина, ПроверятьСтандартные = Истина) 
	
	Попытка 
		СсылкаОбъекта = Объект.Ссылка;
		Метаданное = Ссылка.Метаданные();
		
		Для каждого Реквизит Из Метаданное.Реквизиты Цикл
			Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ПроверятьСтандартные Тогда
			Для каждого Реквизит Из Метаданное.СтандартныеРеквизиты Цикл
				Если Объект[Реквизит.Имя] <> СсылкаОбъекта[Реквизит.Имя] Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		Если ПроверятьТабличныеЧасти Тогда
			Для каждого ТЧ Из Метаданное.ТабличныеЧасти Цикл
				
				Если Объект[ТЧ.Имя].Количество() <> СсылкаОбъекта[ТЧ.Имя].Количество() Тогда
					Возврат Истина;
				КонецЕсли;
				
				Для Индекс = 0 По Объект[ТЧ.Имя].Количество() - 1 Цикл
					ОбъектСтрокаТЧ = Объект[ТЧ.Имя][Индекс];
					СсылкаСтрокаТЧ = СсылкаОбъекта[ТЧ.Имя][Индекс];
					Для каждого РеквизитТЧ Из ТЧ.Реквизиты Цикл
						Если ОбъектСтрокаТЧ[РеквизитТЧ.Имя] <> СсылкаСтрокаТЧ[РеквизитТЧ.Имя] Тогда
							Возврат Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЦикла;        
		КонецЕсли;
		
		Возврат Ложь;
	Исключение
		Возврат Истина;
	КонецПопытки;	
		
КонецФункции

#КонецОбласти
